In [1]:
import pymysql
import sqlalchemy as alch # python -m pip install --upgrade 'sqlalchemy<2.0'
from getpass import getpass
import pandas as pd

In [2]:
password = getpass("Please enter your password: ")

In [3]:
dbName = "sakila"

In [4]:
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"

In [5]:
engine = alch.create_engine(connectionData)

In [9]:
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [22]:
#1. How many copies of the film _Hunchback Impossible_ exist in the inventory system?

pd.read_sql_query("""
SELECT COUNT(i.film_id) 
FROM sakila.inventory as i
JOIN sakila.film as f
ON f.film_id = i.film_id
WHERE f.title = "Hunchback Impossible";
""", engine)

   COUNT(i.film_id)
0                 6

In [23]:
# 2. List all films whose length is longer than the average of all the films.


pd.read_sql_query("""
SELECT title, length
FROM film
WHERE length > (SELECT AVG(length) FROM film);

""", engine)

                title  length
0    AFFAIR PREJUDICE     117
1         AFRICAN EGG     130
2        AGENT TRUMAN     169
3     ALAMO VIDEOTAPE     126
4      ALASKA PHANTOM     136
..                ...     ...
484      WORST BANGER     185
485        WRATH MILE     176
486    WRONG BEHAVIOR     178
487    YOUNG LANGUAGE     183
488        YOUTH KICK     179

[489 rows x 2 columns]

In [24]:
# 3. Use subqueries to display all actors who appear in the film _Alone Trip_.
pd.read_sql_query("""
select first_name, Last_name
from actor
where actor_id IN (
  select actor_id
  from film_actor
  where film_id = (
    select film_id
    from film
    where title = 'Alone Trip'
  )
);

""", engine)

  first_name Last_name
0         ED     CHASE
1       KARL     BERRY
2        UMA      WOOD
3      WOODY     JOLIE
4    SPENCER      DEPP
5      CHRIS      DEPP
6   LAURENCE   BULLOCK
7      RENEE      BALL

In [27]:

pd.read_sql_query("""
select category_id, name
from category
""", engine)

    category_id         name
0             1       Action
1             2    Animation
2             3     Children
3             4     Classics
4             5       Comedy
5             6  Documentary
6             7        Drama
7             8       Family
8             9      Foreign
9            10        Games
10           11       Horror
11           12        Music
12           13          New
13           14       Sci-Fi
14           15       Sports
15           16       Travel

In [31]:
# 4. Sales have been lagging among young families, and you wish 
# to target all family movies for a promotion. Identify all movies categorized as family films.


pd.read_sql_query("""
select film_id, title 
from film
where film_id in (
select film_id 
from sakila.film_category as C
join sakila.category as d
	on c.category_id = d.category_id
    where c.category_id = "8");
""", engine)

    film_id             title
0         5       AFRICAN EGG
1        31     APACHE DIVINE
2        43    ATLANTIS CAUSE
3        50   BAKED CLEOPATRA
4        53         BANG KWAI
..      ...               ...
64      832       SPLASH GUMP
65      866      SUNSET RACER
66      867     SUPER WYOMING
67      946  VIRTUAL SPOILERS
68      975      WILLOW TRACY

[69 rows x 2 columns]

In [32]:
# 5. Get name and email from customers from Canada using subqueries. Do the same with joins.
#  Note that to create a join, you will have to identify the correct tables with their primary keys and foreign keys,
#  that will help you get the relevant information.


pd.read_sql_query("""
select first_name, last_name, email
from sakila.customer as c
join sakila.address as a
	on a.address_id = c.address_id
		join sakila.city as i
        on  i.city_id = a.city_id
			join sakila.country as h
				on h.country_id = i.country_id
                where country = "Canada";
""", engine)

  first_name  last_name                                 email
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org

In [33]:
pd.read_sql_query("""
SELECT first_name, last_name, email
FROM customer
WHERE address_id IN (
    SELECT address_id
    FROM address
    WHERE city_id IN (
        SELECT city_id
        FROM city
        WHERE country_id IN (
            SELECT country_id
            FROM country
            WHERE country = "Canada"
        )
    )
);
""", engine)

  first_name  last_name                                 email
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org

In [34]:
# 6. Which are films starred by the most prolific actor? 
# Most prolific actor is defined as the actor that has acted in the most number of films. 
# First you will have to find the most prolific actor
#  and then use that actor_id to find the different films that he/she starred.


pd.read_sql_query("""
SELECT title
from film
join film_actor
	on film.film_id = film_actor.film_id
    where actor_id = ( select actor_id
	from film_actor
		group by actor_id
        order by count(film_id)desc
        limit 1);
""", engine)

                      title
0              BED HIGHBALL
1         CALENDAR GUNFIGHT
2           CHAMBER ITALIAN
3           CHAPLIN LICENSE
4       CHARIOTS CONSPIRACY
5           CLUELESS BUCKET
6       COLDBLOODED DARLING
7         CONEHEADS SMOOCHY
8              DARKNESS WAR
9            DEER VIRGINIAN
10             DOGMA FAMILY
11          ELEPHANT TROJAN
12           EXCITEMENT EVE
13           FRISCO FORREST
14              GANDHI KWAI
15        GOODFELLAS SALUTE
16            GUNFIGHT MOON
17             HALL CASSIDY
18     HEARTBREAKERS BRIGHT
19            HOOK CHARIOTS
20              HYDE DOCTOR
21           IMPACT ALADDIN
22              INDIAN LOVE
23           INTRIGUE WORST
24          LICENSE WEEKEND
25          LOUISIANA HARRY
26       MAGNIFICENT CHITTY
27         METAL ARMAGEDDON
28        MIDNIGHT WESTWARD
29        MOVIE SHAKESPEARE
30          MUMMY CREATURES
31             OPEN AFRICAN
32           SEARCHERS WAIT
33              SEVEN SWARM
34            SIERRA DIVIDE
35      SPIRITED CASUALTIES
36          STORM HAPPINESS
37              SUGAR WONKA
38         TELEGRAPH VOYAGE
39  TRAINSPOTTING STRANGERS
40                WIFE TURN
41              WINDOW SIDE

In [35]:
# 7. Films rented by most profitable customer. You can use the customer table and payment table to find the most profitable customer ie the customer that has made the largest sum of payments


pd.read_sql_query("""
WITH customer_payment_sum AS (
  SELECT customer_id, SUM(amount) AS payment_sum
  FROM sakila.payment
  GROUP BY customer_id
)
SELECT title
FROM sakila.payment
JOIN sakila.rental ON payment.rental_id = rental.rental_id
JOIN sakila.inventory ON rental.inventory_id = inventory.inventory_id
JOIN sakila.film ON inventory.film_id = film.film_id
JOIN customer_payment_sum ON payment.customer_id = customer_payment_sum.customer_id
WHERE customer_payment_sum.payment_sum = (
  SELECT MAX(payment_sum)
  FROM customer_payment_sum
);

""", engine)

                    title
0        DESTINY SATURDAY
1          CYCLONE FAMILY
2              SLUMS DUCK
3          FIDELITY DEVIL
4             SPLASH GUMP
5       MISSION ZOOLANDER
6        MULHOLLAND BEAST
7          PRINCESS GIANT
8           PARIS WEEKEND
9               RACER EGG
10         WEDDING APOLLO
11       BIKINI BORROWERS
12         ROBBERY BRIGHT
13               SPY MILE
14        MOONWALKER FOOL
15       METAL ARMAGEDDON
16    RIDGEMONT SUBMARINE
17            HIGH ENCINO
18           DURHAM PANKY
19            GANGS PRIDE
20             DATE SPEED
21     HEAVYWEIGHTS BEAST
22             DUMBO LUST
23        GOLDMINE TYCOON
24       ENGLISH BULWORTH
25    BRINGING HYSTERICAL
26  FORRESTER COMANCHEROS
27        REAP UNFAITHFUL
28           DESIRE ALIEN
29        LONELY ELEPHANT
30          BETRAYED REAR
31       SINNERS ATLANTIS
32               INCH JET
33       FOOL MOCKINGBIRD
34         BLUES INSTINCT
35         REMEMBER DIARY
36          INSECTS STONE
37         PICKUP DRIVING
38         WEDDING APOLLO
39        TERMINATOR CLUB
40          MASSAGE IMAGE
41            MILLION ACE
42        QUEST MUSSOLINI
43       NOVOCAINE FLIGHT
44         STING PERSONAL